stillingBasinOutlet/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;


x1 10;
x2 85;
y1 1;
y2 0;

//grading
nz 30;
gdz 1.6;

vertices
(
    ( $x1  $y1 29.5)
    ( 25  $y1 29.5)
    ( 35 $y1 25)
    ( 55  $y1 5)
    ( $x2  $y1 5)

    ( $x1 $y1 38)
    ( 25.5 $y1 38)
    ( 41 $y1 35)
    ( 60 $y1 30)
    ( $x2 $y1 30)

    ($x1  $y2 29.5)
    ( 25  $y2 29.5)
    ( 35 $y2 25)
    ( 55  $y2 5)
    ( $x2  $y2 5)

    ($x1 $y2 38)
    ( 25.5 $y2 38)
    ( 41 $y2 35)
    ( 60 $y2 30)
    ( $x2 $y2 30)
);

blocks
(
    hex (10 11 1 0 15 16 6 5) (18 1 $nz) simpleGrading (0.6 1 $gdz)
    hex (11 12 2 1 16 17 7 6) (18 1 $nz) simpleGrading (1.1 1 $gdz)
    hex (12 13 3 2 17 18 8 7) (30 1 $nz) simpleGrading (1.2 1 $gdz)
    hex (13 14 4 3 18 19 9 8) (27 1 $nz) simpleGrading (1.5 1 $gdz)
);

edges
(
     arc 1 2 (30.04 $y1 28.40)
     arc 11 12 (30.04 $y2 28.40)
     arc 6 7 (33.14 $y1 37.24)
     arc 16 17 (33.14 $y2 37.24)
     arc 7 8 (50.34  $y1 31.89)
     arc 17 18 (50.34  $y2 31.89)
);

patches
(
    patch inlet
    (
        (0 10 15 5)
    )
    patch outlet
    (
        (4 9 19 14)
    )
    wall lowerWall
    (
        (0 1 11 10)
        (1 2 12 11)
        (2 3 13 12)
        (3 4 14 13)
    )
    patch atmosphere
    (
        (15 16 6 5)
        (16 17 7 6)
        (17 18 8 7)
        (18 19 9 8)
    )
    patch front
    (
        (10 11 16 15)
        (11 12 17 16)
        (12 13 18 17)
        (13 14 19 18)
    )
    patch back
    (
        (5 6 1 0)
        (6 7 2 1)
        (7 8 3 2)
        (8 9 4 3)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
