stillingBasinOutlet/system/extrudeMeshDict2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

constructFrom mesh;
sourceCase "$FOAM_CASE";
sourcePatches (outlet);

flipNormals false;

extrudeModel        linearDirection;

nLayers             10;
expansionRatio      1.05;

linearDirectionCoeffs
{
    axisPt          (0 0 0);
    direction       (1 0 -0.01);
    thickness       10;
}

mergeFaces false;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //